
TOPSKATPROGRAM: PROCEDURE OPTIONS(MAIN);

   DCL INDKOMST        FIXED DEC(9,2);
   DCL TOPSKAT         FIXED DEC(9,2);
   DCL TOPTOPSKAT      FIXED DEC(9,2);
   DCL TOTALSKAT       FIXED DEC(9,2);
   DCL SKATTEGRÆNSE    FIXED DEC(9,2) INIT(568900.00);
   DCL TOPTOPGRÆNSE    FIXED DEC(9,2) INIT(2500000.00);
   DCL TOPSKAT_PROCENT FIXED DEC(3,2) INIT(0.15);
   DCL TOPTOP_PROCENT  FIXED DEC(3,2) INIT(0.05);

   /* Input af indkomst */
   PUT SKIP LIST('Indtast årsindkomst i kr:');
   GET LIST(INDKOMST);

   /* Beregning af topskat */
   IF INDKOMST > SKATTEGRÆNSE THEN
      TOPSKAT = (MIN(INDKOMST, TOPTOPGRÆNSE) - SKATTEGRÆNSE) * TOPSKAT_PROCENT;
   ELSE
      TOPSKAT = 0;

   /* Beregning af top-topskat */
   IF INDKOMST > TOPTOPGRÆNSE THEN
      TOPTOPSKAT = (INDKOMST - TOPTOPGRÆNSE) * TOPTOP_PROCENT;
   ELSE
      TOPTOPSKAT = 0;

   TOTALSKAT = TOPSKAT + TOPTOPSKAT;

   PUT SKIP LIST('-----------------------------');
   PUT SKIP LIST('Topskat:       ', TOPSKAT);
   PUT SKIP LIST('Top-topskat:   ', TOPTOPSKAT);
   PUT SKIP LIST('Samlet skat:   ', TOTALSKAT);
   PUT SKIP LIST('-----------------------------');

END TOPSKATPROGRAM;
